#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Date: Jul. 18th , 2020
# Author: Mickey Zhu

#=============================================================================
# Import packages
#=============================================================================

#=============================================================================
# Definitions
#=============================================================================

#=============================================================================
# Static Variables
#=============================================================================

#=============================================================================
# Global Variables
#=============================================================================
class g_var():

    # 看门狗类型，有效时是object，无效时是None
    wdt                 = None
    
    # 继电器状态，开启是True，关闭是False
    relay_status        = False
    
    # 距离长度cm和状态
    original_distance   = 999
    distance_valid      = False
    
    # 一些状态，嗯。。。应该不用解释
    wifi_status         = ''
    internet_status     = ''
    current_ssid        = ''

    # 所有外发的状态字典变量
    main_status = {
    'delay_on_time':          10001,
    'wdt_enabled':           False,
    'relay_status':         False,
    'distance':0,
    'wifi_status':'',
    'internet_status':'',
    'current_ssid':''
    }

    # 所有外发/订阅的配置字典变量
    main_config = {
    'wdt_config':None,
    'relay_config':None
    }
    
    # 本地配置
    local_config = {}
    
    # 缺省配置
    default_local_config = {
    "wifi_pwd": "11111", 
    "wdt_enable": "false", 
    "wifi_ssid": "AAAAA"
    }


#=============================================================================
# Function Definitions
#=============================================================================

#=============================================================================
# Main code start
#=============================================================================


